leetcode/334/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>334.Increasing Triplet Subsequence - enzo&#39;s note book</title>
  <meta charset="utf-8" />
  <meta name="author" content="enzo liu" />
  <meta name="description" content="leetcode" />
  <meta name="keywords" content="leetcode, ruby" />

  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">
  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/posts.css" type="text/css">

</head>

  <body class="container">
<header id="header">
    <body>
        <nav class="navbar navbar-default navbar-fixed-top" style="opacity: .9" role="navigation">
            <div class="container-fluid">
                <div class="navbar-header">
                    <button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#bs-example-navbar-collapse-1">
                        <span class="sr-only">Toggle navigation</span>
                        <span class="icon-bar"></span>
                        <span class="icon-bar"></span>
                        <span class="icon-bar"></span>
                    </button>
                    <a class="navbar-brand" href="/">enzo&#39;s note book</a>
                </div>
                <div class="collapse navbar-collapse" id="bs-example-navbar-collapse-1">
                    <ul class="nav navbar-nav navbar-right">
                            <li class="active"><a href="/blog/">Blog</a></li>
                            <li class="active"><a href="/history/">History</a></li>
                            <li class="active"><a href="/leetcode/">Leetcode</a></li>
                        <li><a href="/tags/">Tags</a></li>
                        <li><a href="/about/">About</a></li>
                        <li><a href="https://github.com/Enzo-Liu">GitHub</a></li>
                        <li><a href="/rss.xml">RSS</a></li>
                    </ul>
                </div>
            </div>
        </nav>
    </body>
</header>

<section id="content" role="main">
    <div id="outline-container-sec-" class="row" style="padding-top: 70px">
        <div class="col-md-2"></div>
            <h1>334.Increasing Triplet Subsequence</h1>
            
<div id="outline-container-orgc9c22a8" class="outline-2">
<h2 id="orgc9c22a8">题目</h2>
<div class="outline-text-2" id="text-orgc9c22a8">
<p>
<a href="https://leetcode.com/problems/increasing-triplet-subsequence/">链接</a>
</p>

<blockquote>
<p>
Given an unsorted array return whether an increasing subsequence of length 3 exists or not in the array.
</p>

<p>
Formally the function should:
  Return true if there exists i, j, k
  such that arr[i] &lt; arr[j] &lt; arr[k] given 0 ≤ i &lt; j &lt; k ≤ n-1 else return false.
  Your algorithm should run in O(n) time complexity and O(1) space complexity.
</p>

<p>
Examples:
Given [1, 2, 3, 4, 5],
return true.
</p>

<p>
Given [5, 4, 3, 2, 1],
return false.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orge6f7f09" class="outline-2">
<h2 id="orge6f7f09">思路</h2>
<div class="outline-text-2" id="text-orge6f7f09">
<p>
问题等价为
</p>
<blockquote>
<p>
寻找对应的m,n,满足a[m]&lt;a[m+1], a[n]&lt;a[n+1], a[m]&lt;a[n] || a[m]&lt;a[n+1] (0&lt;=m&lt;n&lt;=n-1)
</p>
</blockquote>
</div>

<div id="outline-container-orgc89690a" class="outline-3">
<h3 id="orgc89690a">长度为2</h3>
<div class="outline-text-3" id="text-orgc89690a">
<p>
假设不存在长度为2的子列，则 <code>a[i]&gt;=a[i+1]</code>, 是一个递减数列。
</p>

<p>
即只要存在 <code>a[i]&lt;a[i+1]</code>, 则存在长度为2的子列。
</p>
</div>
</div>

<div id="outline-container-orga3f2a60" class="outline-3">
<h3 id="orga3f2a60">长度为3</h3>
<div class="outline-text-3" id="text-orga3f2a60">
<ul class="org-ul">
<li>假设存在长度为3
<ol class="org-ol">
<li>一定存在长度为2的增长数列, 所以一定存在 <code>a[i]&lt;a[i+1]</code></li>
<li>对于 a[i]&lt;a[j]&lt;a[k] (i&lt;=j&lt;=k) , 一定存在 a[m]&lt;a[m+1], a[n]&lt;a[n+1], a[m+1]&lt;a[n+1] || a[m]&lt;a[n] (i&lt;=m&lt;n&lt;=k)</li>
</ol></li>

<li>假设存在 a[m]&lt;a[m+1], a[n]&lt;a[n+1], a[m+1]&lt;a[n+1] || a[m]&lt;a[n] (0&lt;=m&lt;n&lt;=n-1)
则存在长度为3的递增子列</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org6fb6b49" class="outline-2">
<h2 id="org6fb6b49">代码</h2>
<div class="outline-text-2" id="text-org6fb6b49">
<div class="org-src-container">
<pre class="src src-ruby"># @param {Integer[]} nums
# @return {Boolean}
def increasing_triplet(nums)
  nums.each{|n|}
    .each_cons(2).select{|e| e[1]&gt;e[0]}
    .each_cons(2).select{|e| e[1][0]&gt;e[0][0] || e[1][1]&gt;e[0][1]}.size &gt;0
end
</pre>
</div>
</div>
</div>

    </div>
</section>


    <div class="post-meta">
        <span title="post date" class="post-info">2016-02-25</span>
        <span title="last modification date" class="post-info">2016-02-25</span>
        <span title="tags" class="post-info"><a href="/tags/leetcode/">leetcode</a>, <a href="/tags/ruby/">ruby</a></span>
        <span title="author" class="post-info">enzo liu</span>
    </div>
<footer class="footer">
    <p>Generated by <a href="http://www.gnu.org/software/emacs/">Emacs</a> 26.x (<a href="http://orgmode.org">Org mode</a> 9.x)</p>
    <p>
        Copyright &copy; 2012 - <span id="footerYear"></span> <a href="mailto:liuenze6516 &lt;at&gt; gmail &lt;dot&gt; com">enzo liu</a>
        &nbsp;&nbsp;-&nbsp;&nbsp;
        Powered by <a href="https://github.com/kelvinh/org-page" target="_blank">org-page</a>
        <script type="text/javascript">document.getElementById("footerYear").innerHTML = (new Date()).getFullYear();</script>
    </p>
</footer>

  </body>
</html>
